{
  "executive_summary": "Senior Software Developer and Developer Department Head with 4 years of engineering experience, including 2 years leading cross-functional teams. Led major platform modernizations (Vue 2 to 3, Nuxt 2 to 3), introduced comprehensive testing practices with Vitest and Cypress, and drove company-wide TypeScript adoption. Currently leading development process optimization initiatives, implementing workflow automation with n8n and AI-assisted tooling to streamline CI/CD pipelines. Proven track record in scaling development teams, mentoring engineers, and delivering high-impact tools that drive business value.",
  "contact_information_digital_footprint": {
    "full_name": "Cacious Siamunyanga",
    "professional_title": "Senior Software Developer | Developer Department Head",
    "phone_number": "+260975670360",
    "email_addresses": ["csiamunyanga@hotmail.com", "csiamunyanga@gmail.com"],
    "location": "Lusaka, Zambia",
    "links": {
      "linkedin": "https://www.linkedin.com/in/cacious7/",
      "github": "https://github.com/cacious7",
      "stack_overflow": "https://stackoverflow.com/users/5979260/cacious",
      "free_code_camp": "https://www.freecodecamp.org/cacious7",
      "codepen": "https://codepen.io/cacious7"
    }
  },
  "core_competencies_technical_acumen": {
    "skills": [
      {"skill": "Excellent Debugging Skills", "proficiency": "Excellent"},
      {"skill": "Team Leadership", "proficiency": "Soft Skill"},
      {"skill": "Mentoring", "proficiency": "Soft Skill"},
      {"skill": "Coaching", "proficiency": "Soft Skill"},
      {"skill": "People Management", "proficiency": "Soft Skill"},
      {"skill": "Constructive Feedback", "proficiency": "Soft Skill"},
      {"skill": "Rapid Learning", "proficiency": "Soft Skill"},
      {"skill": "Process Optimization", "proficiency": "Soft Skill"},
      {"skill": "JavaScript", "proficiency": "Proficient"},
      {"skill": "TypeScript", "proficiency": "Proficient"},
      {"skill": "Vue", "proficiency": "Proficient"},
      {"skill": "Nuxt", "proficiency": "Proficient"},
      {"skill": "Node.js", "proficiency": "Proficient"},
      {"skill": "SQL", "proficiency": "Proficient"},
      {"skill": "HTML", "proficiency": "Proficient"},
      {"skill": "CSS", "proficiency": "Proficient"},
      {"skill": "AI Agent Mastery", "proficiency": "Proficient"},
      {"skill": "React", "proficiency": "Experienced"},
      {"skill": "Docker", "proficiency": "Experienced"},
      {"skill": "Make", "proficiency": "Experienced"},
      {"skill": "Devcontainers", "proficiency": "Experienced"},
      {"skill": "Codespaces", "proficiency": "Experienced"},
      {"skill": "WebAssembly", "proficiency": "Experienced"},
      {"skill": "Service Workers", "proficiency": "Experienced"},
      {"skill": "n8n", "proficiency": "Experienced"},
      {"skill": "CI/CD", "proficiency": "Experienced"},
      {"skill": "Vitest", "proficiency": "Experienced"},
      {"skill": "Cypress", "proficiency": "Experienced"},
      {"skill": "MCP", "proficiency": "Experienced"},
      {"skill": "VueFlow", "proficiency": "Familiar"},
      {"skill": "TOML", "proficiency": "Familiar"},
      {"skill": "Python", "proficiency": "Exploring"},
      {"skill": "PHP", "proficiency": "Exploring"},
      {"skill": "Laravel", "proficiency": "Exploring"},
      {"skill": "Handlebars", "proficiency": "Exploring"},
      {"skill": "Java", "proficiency": "Foundational"},
      {"skill": "C", "proficiency": "Foundational"},
      {"skill": "C++", "proficiency": "Foundational"},
      {"skill": "OOP", "proficiency": "Foundational"}
    ]
  },
  "professional_experience": [
    {
      "company_name": "Connex Carrier Services Ltd (ConnexCS)",
      "titles": ["Senior Software Developer", "Developer Department Head"],
      "dates_tenure": "Apr 2021 - Present 路 4 yrs 7 mos (Remote)",
      "key_responsibilities_achievements": [
        "Led developer team of 5+ engineers for 2 years, overseeing technical strategy, code quality, and project delivery.",
        "Recruited and onboarded 3 high-performing developers, establishing rigorous code review standards and technical mentorship programs.",
        "Leading MCP (Model Context Protocol) implementation and development process optimization using n8n to automate workflows between ClickUp and GitHub, enabling AI-assisted resolution of routine issues and streamlining the CI/CD pipeline.",
        "Introduced and established comprehensive testing culture with Vitest (unit testing) and Cypress (E2E testing), significantly improving code reliability and reducing production bugs through systematic early detection.",
        "Spearheaded migration of 2 major production applications (Control Panel and Customer Portal) from Vue 2.5 to Vue 3, significantly reducing technical debt and improving developer experience through access to modern tooling.",
        "Introduced TypeScript across 5+ critical projects, substantially reducing production runtime errors and establishing team-wide standards for type safety and code maintainability.",
        "Architected and launched company website using Nuxt 2, then led migration to Nuxt 3, modernizing the technology stack and ensuring long-term maintainability.",
        "Built 4 production-grade internal tools: SIP call flow builder, WebAssembly-based database manager, custom IDE for platform extensions, and SDP manipulation software for telecom operations.",
        "Implemented Service Workers across 3 web applications, enabling robust offline functionality and improving application resilience during network interruptions.",
        "Conducted 200+ code reviews, maintaining team coding standards and mentoring developers on best practices and design patterns.",
        "Researched and integrated emerging technologies (VueFlow, AI-powered log analysis) to improve diagnostic workflows and reduce troubleshooting time for complex call issues."
      ],
      "technologies_utilized": ["Vue", "JavaScript", "Node.js", "HTML", "CSS", "SQL", "TypeScript", "Nuxt", "Vitest", "Cypress", "Service Workers", "WASM", "VueFlow", "n8n", "MCP", "AI/ML concepts"]
    },
    {
      "company_name": "Gulait Online Trade",
      "titles": ["Chief Executive Officer"],
      "dates_tenure": "Sep 2019 - Apr 2021 路 1 yr 8 mos (Zambia)",
      "key_responsibilities_achievements": [
        "Founded e-commerce startup serving Zambian market, managing full business operations including product development, vendor onboarding, and go-to-market strategy.",
        "Built multi-vendor marketplace platform using WordPress and Dokan, creating infrastructure to connect local vendors with customers and enable online commerce in an emerging market.",
        "Gained hands-on experience in startup operations: financial planning, resource allocation, market validation, and strategic decision-making under resource constraints.",
        "Learned critical lessons about market readiness, funding requirements, and product-market fit in emerging markets that inform current approach to product development."
      ],
      "technologies_utilized": ["WordPress", "Dokan plugin", "E-commerce platforms", "ES6", "Responsive Web Design"]
    },
    {
      "company_name": "Dephlex Creatives",
      "titles": ["Web Developer"],
      "dates_tenure": "Feb 2019 - Sep 2019 路 7 mos (China)",
      "key_responsibilities_achievements": [
        "Contributed to diverse web development projects across multiple industries including education, fashion, and creative sectors, gaining broad exposure to different business requirements and design approaches.",
        "Developed professional websites and web applications in fast-paced agency environment, learning to balance quality with tight deadlines and client expectations.",
        "Collaborated with designers and project managers to translate creative concepts into functional, responsive web experiences that met client specifications.",
        "Built foundational skills in professional web development workflows, version control, client communication, and delivering production-ready code in team environment."
      ],
      "technologies_utilized": ["HTML5", "CSS3", "JavaScript", "jQuery", "Responsive Web Design", "WordPress"]
    },
    {
      "company_name": "Self-Employed",
      "titles": ["Freelance Web Developer"],
      "dates_tenure": "Jan 2016 - Feb 2019 路 3 yrs 1 mo (China)",
      "key_responsibilities_achievements": [
        "Delivered web development projects for international clients across fashion, technology, and creative industries, building strong portfolio of production-ready applications.",
        "Notable client: theVcollection (fashion brand website with professional PSD-to-HTML conversion), demonstrating ability to execute pixel-perfect designs.",
        "Built expertise in independent client communication, project scoping, deadline management, and remote collaboration across time zones and cultural contexts.",
        "Specialized in responsive, mobile-first web applications using modern frameworks, ensuring accessibility and optimal user experience across all devices and browsers."
      ],
      "technologies_utilized": ["HTML5", "CSS3", "JavaScript", "Vue.js", "Laravel", "Responsive Web Design", "API Integration"]
    }
  ],
  "key_projects_open_source_contributions": {
    "projects": [
      {
        "name": "Mulawo - AI Legal Assistant",
        "url": "https://mulawo.com/",
        "description": "Proprietary AI-powered legal assistant specialized in Zambian law. Architected and deployed complete end-to-end solution including data crawling, cleaning, and preprocessing to create high-quality RAG (Retrieval-Augmented Generation) service. Implements intelligent citation retrieval and document linking. Sole developer managing all aspects including infrastructure, hosting, SEO optimization, customer acquisition, and marketing strategy.",
        "technologies": ["AI/ML", "RAG", "Data Engineering", "Full-Stack Development", "SEO", "Cloud Hosting"],
        "tags": ["Entrepreneurship", "AI", "SaaS", "Proprietary"]
      },
      {
        "name": "CaxhCipher - Encryption Library",
        "url": "https://github.com/cacious7/caxhcipher",
        "npm": "https://www.npmjs.com/package/caxhcipher",
        "description": "Encryption library published on NPM, providing secure cryptographic utilities for JavaScript/TypeScript applications. Demonstrates expertise in security, cryptography, and package distribution.",
        "technologies": ["JavaScript", "Cryptography", "NPM"],
        "tags": ["Open Source", "NPM Package", "Security"]
      },
      {
        "name": "Connexcs/cxAMQP",
        "url": "https://github.com/connexcs/cxAMQP",
        "npm": "https://www.npmjs.com/package/cx-amqp",
        "description": "Key contributor responsible for converting the project to TypeScript, implementing unit testing infrastructure using Vitest, and maintaining stringent coding standards. Enhanced code robustness, maintainability, and test coverage for this critical AMQP messaging library.",
        "technologies": ["TypeScript", "Vitest", "Node.js", "AMQP", "Testing"],
        "tags": ["Open Source", "NPM Package", "TypeScript"]
      },
      {
        "name": "Wikipedia Viewer",
        "url": "https://codepen.io/cacious7/full/ypYZpr",
        "description": "Interactive Wikipedia search application demonstrating clean UI/UX design and API integration skills.",
        "technologies": ["JavaScript", "HTML5", "CSS3", "API Integration"],
        "tags": ["Open Source", "Web App"]
      }
    ]
  },
  "education_continuous_learning": {
    "formal_education": [
      {
        "institution": "ZICAS (Zambia Institute of Chartered Accountants)",
        "degree_course": "Bachelor's degree, Internet Technology and Computing",
        "dates": "2019 - 2023",
        "note": "Completed while working full-time at ConnexCS (remote)"
      },
      {
        "institution": "Wuhan University, China",
        "degree_course": "Bachelor's Degree, Computer Software Engineering",
        "dates": "2015 - 2019"
      }
    ],
    "self_directed_learning": [
      {
        "platform_topic": "FreeCodeCamp",
        "details": "Acquired expertise in data structures and full-stack web development, solidifying his capabilities as a Full Stack Developer proficient with tools like Docker, Make, and Devcontainers/Codespaces."
      },
      {
        "platform_topic": "Core Learning Philosophy",
        "details": "Possesses a unique ability to quickly learn and integrate new skills, enabling the rapid transformation of concepts into functional products, regardless of the underlying technology stack."
      },
      {
        "platform_topic": "Foundational Knowledge (OOP)",
        "details": "Grounded in strong Object-Oriented Programming (OOP) principles from studies in Java, C, and C++, providing a comprehensive understanding of data processing and conceptualization across diverse programming languages."
      }
    ]
  }
}
