{
  "executive_summary": "Highly accomplished Senior Software Developer and Developer Department Head with approximately 4 years of experience, including 2 years in leadership, specializing in modern web application development and team management. Proficient in Vue, Nuxt, TypeScript, and Node.js, with a proven track record of leading large-scale platform modernizations (Vue 2.5 to Vue 3, Nuxt 2 to Nuxt 3), introducing critical technologies like TypeScript, and building comprehensive solutions that significantly enhance company value and competitive standing. Adept at leveraging advanced debugging skills and AI agent mastery to accelerate development cycles and ensure high-quality, scalable solutions. Seeking to apply deep technical acumen and leadership prowess to drive innovation and foster high-performing development teams.",
  "contact_information_digital_footprint": {
    "full_name": "Cacious Siamunyanga",
    "professional_title": "Senior Software Developer | Developer Department Head",
    "phone_number": "+260975670360",
    "email_addresses": ["csiamunyanga@hotmail.com", "csiamunyanga@gmail.com"],
    "location": "Lusaka, Zambia",
    "links": {
      "linkedin": "https://www.linkedin.com/in/cacious7/",
      "github": "https://github.com/cacious7",
      "stack_overflow": "https://stackoverflow.com/users/5979260/cacious",
      "free_code_camp": "https://www.freecodecamp.org/cacious7",
      "codepen": "https://codepen.io/cacious7"
    }
  },
  "core_competencies_technical_acumen": {
    "skills": [
      {"skill": "Excellent Debugging Skills", "proficiency": "Excellent"},
      {"skill": "JavaScript (JS)", "proficiency": "Proficient"},
      {"skill": "TypeScript", "proficiency": "Proficient"},
      {"skill": "Vue", "proficiency": "Proficient"},
      {"skill": "Nuxt", "proficiency": "Proficient"},
      {"skill": "Node.js", "proficiency": "Proficient"},
      {"skill": "SQL", "proficiency": "Proficient"},
      {"skill": "HTML", "proficiency": "Proficient"},
      {"skill": "CSS", "proficiency": "Proficient"},
      {"skill": "AI Agent Mastery", "proficiency": "Proficient"},
      {"skill": "OOP (Object-Oriented Prog.)", "proficiency": "Strong Values"},
      {"skill": "Rapid Learning", "proficiency": "Core Competency"},
      {"skill": "React", "proficiency": "Experienced"},
      {"skill": "Docker", "proficiency": "Experienced"},
      {"skill": "Make", "proficiency": "Experienced"},
      {"skill": "Devcontainers / Codespaces", "proficiency": "Experienced"},
      {"skill": "WebAssembly (WASM)", "proficiency": "Experienced"},
      {"skill": "Service Workers", "proficiency": "Experienced"},
      {"skill": "Vitest (Unit Tests)", "proficiency": "Medium Proficiency"},
      {"skill": "Cypress (E2E)", "proficiency": "Medium Proficiency"},
      {"skill": "VueFlow", "proficiency": "Familiar"},
      {"skill": "TOML", "proficiency": "Familiar"},
      {"skill": "Python (Machine Learning)", "proficiency": "Exploring"},
      {"skill": "PHP (Laravel Framework)", "proficiency": "Exploring"},
      {"skill": "Handlebars", "proficiency": "Exploring"},
      {"skill": "Java, C, C++ (OOP)", "proficiency": "Foundational"}
    ]
  },
  "professional_experience": [
    {
      "company_name": "Connex Carrier Services Ltd (ConnexCS)",
      "titles": ["Senior Software Developer", "Developer Department Head"],
      "dates_tenure": "Apr 2021 - Present · 4 yrs 7 mos (Remote)",
      "key_responsibilities_achievements": [
        "Led the developer department as head for approximately 2 years, overseeing team performance and strategic direction.",
        "Chaired regular team meetings, fostering collaboration and ensuring optimal developer team performance.",
        "Actively participated in the hiring processes, identifying and selecting high-performing developers aligned with company needs.",
        "Spearheaded the comprehensive migration of major applications, including Control Panel and Customer Portal, from Vue 2.5 to the latest Vue 3 version. This modernization effort significantly enhanced platform performance and maintainability, reducing technical debt and improving developer efficiency through modern tooling.",
        "Pioneered the introduction and integration of TypeScript across critical projects, leading to a substantial reduction in runtime errors and a marked improvement in code quality and maintainability. This initiative enhanced team collaboration through improved type safety and code predictability.",
        "Architected and developed the company's front website from scratch using Nuxt 2, subsequently leading its conversion to a Nuxt 3 application. This upgrade improved website performance, user experience, and potentially contributed to enhanced search engine visibility.",
        "Developed several comprehensive and leading projects, including a Call SDP manipulation software for SIP calls, a browser-based database management solution utilizing WebAssembly (WASM), and an IDE facilitating app creation and extensions within ConnexCS resources. These projects streamlined operations, introduced new capabilities, and provided significant value by automating complex processes and enabling internal innovation.",
        "Implemented Service Workers for key web applications, enabling robust offline functionality and improving perceived performance, thereby enhancing user experience and application reliability.",
        "Actively involved in bug fixes, significantly contributing to the stability and reliability of applications.",
        "Implemented robust testing frameworks using Vitest for unit tests and Cypress for end-to-end testing, enhancing software quality and reducing critical bug occurrences.",
        "Conducted rigorous code reviews, ensuring adherence to coding standards and fostering high-quality code delivery across the team.",
        "Proactively researched and integrated cutting-edge technologies, such as VueFlow, to enhance existing features and explore new capabilities.",
        "Investigated and implemented methods to leverage AI for enhancing existing features, particularly in the analysis of logging data like call SIP traces. This initiative aimed to reduce diagnostic time for complex call issues and improve data-driven decision-making."
      ],
      "technologies_utilized": ["Vue", "JavaScript", "Node.js", "HTML", "CSS", "SQL", "TypeScript", "Nuxt", "Vitest", "Cypress", "Service Workers", "WASM", "VueFlow", "AI/ML concepts"]
    },
    {
      "company_name": "Gulait Online Trade",
      "titles": ["Chief Executive Officer"],
      "dates_tenure": "Sep 2019 - Apr 2021 · 1 yr 8 mos (Zambia)",
      "key_responsibilities_achievements": [
        "Founded and led an online trading platform focused on the Zambian market.",
        "Managed full business operations including strategic planning, product development, and market positioning.",
        "Developed e-commerce solutions utilizing WordPress and Dokan plugin to enable multi-vendor marketplace functionality.",
        "Gained invaluable experience in full project lifecycle management, including planning, development, and resource allocation for a startup venture.",
        "Acquired critical understanding of the immense resources and meticulous preparation required for project success in emerging markets."
      ],
      "technologies_utilized": ["WordPress", "Dokan plugin", "E-commerce platforms", "ES6", "Responsive Web Design"]
    },
    {
      "company_name": "Self-Employed",
      "titles": ["Freelance Web Developer"],
      "dates_tenure": "Jan 2016 - Sep 2019 · 3 yrs 9 mos (China)",
      "key_responsibilities_achievements": [
        "Provided freelance web development services to international clients while based in China.",
        "Specialized in building responsive, mobile-first web applications and prototypes.",
        "Developed experience with modern web technologies and design frameworks.",
        "Built strong foundation in full-stack web development and client communication."
      ],
      "technologies_utilized": ["HTML5", "CSS3", "JavaScript", "Responsive Web Design", "ES6", "Web Development"]
    },
    {
      "company_name": "Dephlex Creatives",
      "titles": ["Web Developer"],
      "dates_tenure": "Feb 2018 - Aug 2018 · 7 mos",
      "key_responsibilities_achievements": [
        "Contributed to various web development projects within a professional agency setting.",
        "Collaborated with design and development teams to deliver client projects.",
        "Developed foundational skills in professional web development workflows and best practices."
      ],
      "technologies_utilized": ["Responsive Web Design", "Web Development"]
    },
    {
      "company_name": "theVcollection",
      "titles": ["Freelance Web Developer"],
      "dates_tenure": "Oct 2017 - Aug 2018 · 11 mos (Wuhan, Hubei, China)",
      "key_responsibilities_achievements": [
        "Created a fashion brand preview and gallery website by designing PSD prototypes and implementing the overall experience."
      ],
      "technologies_utilized": ["HTML5", "CSS3", "JavaScript", "Vue.js", "Laravel", "Responsive Web Design", "Web Development"]
    }
  ],
  "key_projects_open_source_contributions": {
    "projects": [
      {
        "name": "Mulawo - AI Legal Assistant",
        "url": "https://mulawo.com/",
        "description": "Proprietary AI-powered legal assistant specialized in Zambian law. Architected and deployed complete end-to-end solution including data crawling, cleaning, and preprocessing to create high-quality RAG (Retrieval-Augmented Generation) service. Implements intelligent citation retrieval and document linking. Sole developer managing all aspects including infrastructure, hosting, SEO optimization, customer acquisition, and marketing strategy.",
        "technologies": ["AI/ML", "RAG", "Data Engineering", "Full-Stack Development", "SEO", "Cloud Hosting"],
        "tags": ["Entrepreneurship", "AI", "SaaS", "Proprietary"]
      },
      {
        "name": "CaxhCipher - Encryption Library",
        "url": "https://github.com/cacious7/caxhcipher",
        "npm": "https://www.npmjs.com/package/caxhcipher",
        "description": "Encryption library published on NPM, providing secure cryptographic utilities for JavaScript/TypeScript applications. Demonstrates expertise in security, cryptography, and package distribution.",
        "technologies": ["JavaScript", "Cryptography", "NPM"],
        "tags": ["Open Source", "NPM Package", "Security"]
      },
      {
        "name": "connexcs/cxAMQP",
        "url": "https://github.com/connexcs/cxAMQP",
        "npm": "https://www.npmjs.com/package/cx-amqp",
        "description": "Key contributor responsible for converting the project to TypeScript, implementing unit testing infrastructure using Vitest, and maintaining stringent coding standards. Enhanced code robustness, maintainability, and test coverage for this critical AMQP messaging library.",
        "technologies": ["TypeScript", "Vitest", "Node.js", "AMQP", "Testing"],
        "tags": ["Open Source", "NPM Package", "TypeScript"]
      },
      {
        "name": "Wikipedia Viewer",
        "url": "https://codepen.io/cacious7/full/ypYZpr",
        "description": "Interactive Wikipedia search application demonstrating clean UI/UX design and API integration skills.",
        "technologies": ["JavaScript", "HTML5", "CSS3", "API Integration"],
        "tags": ["Open Source", "Web App"]
      }
    ]
  },
  "education_continuous_learning": {
    "formal_education": [
      {
        "institution": "ZICAS",
        "degree_course": "Bachelor's degree, Computers (Internet Technology and Computing)",
        "dates": "2019 - 2023"
      },
      {
        "institution": "Wuhan University",
        "degree_course": "Bachelor's Degree, Computer Software Engineering",
        "dates": "2015 - 2019"
      }
    ],
    "self_directed_learning": [
      {
        "platform_topic": "FreeCodeCamp",
        "details": "Acquired expertise in data structures and full-stack web development, solidifying his capabilities as a Full Stack Developer proficient with tools like Docker, Make, and Devcontainers/Codespaces."
      },
      {
        "platform_topic": "Core Learning Philosophy",
        "details": "Possesses a unique ability to quickly learn and integrate new skills, enabling the rapid transformation of concepts into functional products, regardless of the underlying technology stack."
      },
      {
        "platform_topic": "Foundational Knowledge (OOP)",
        "details": "Grounded in strong Object-Oriented Programming (OOP) principles from studies in Java, C, and C++, providing a comprehensive understanding of data processing and conceptualization across diverse programming languages."
      }
    ]
  }
}
